1s/ERP/Conf/Enums/ВидыДоходовИностранныхОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоходовИностранныхОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДивидендыКонтролируемаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДивидендыНоминальныйДержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДивидендыУполномоченныйДержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДивидендыДепозитарныеПрограммы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДоходыЦБНоминальныйДержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДоходыЦБУполномоченныйДержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДоходыЦБДепозитарныеПрограмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыОтРаспределенияПрибыли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыГосЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыИнтеллектуальнаяСобственность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыОтРеализацииАкцийРФБолее50</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыОтРеализацииАкцийРФНеБолее50</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРеализацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыСрочныеФинИнструменты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыВалютныеОпераций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРеализацияНедвижимостиРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРеализацияНедвижимостиНеРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРеализацияИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыАрендаИмуществаРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыАрендаИмуществаНеРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыАрендаТранспортаМеждународныеПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыМеждународныеПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыТЭО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремииСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыДепоПремий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрафыПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыПИФБолее50</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыПИФНеБолее50</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыЦФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыСервисныеРиски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыИноеИмуществоНеОблагаемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыИмущественныеПраваНеОблагаемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыУслугиНеОблагаемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыОблигацииНеОблагаемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыВПределахВкладаАкционера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДоходыОблагаемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДоходыНеОблагаемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыУслугиВзаимозависимым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходПриравненныйДивидендам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыМайнинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитываемыеВОтчетности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВидыДоходовИностранныхОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ИСТИНА, если вид дохода иностранной организации не облагается налогом в РФ, ЛОЖЬ - в ином случае. 
//
// Параметры:
//   ВидДохода - ПеречислениеСсылка.ВидыДоходовИностранныхОрганизаций.
//
// Возвращаемое значение:
//   Булево - признак облагаемости налогом.
Функция ЭтоНеОблагаемыйНалогомВидДохода(ВидДохода) Экспорт
	
	// В соответствии с контрольными соотношениями от ФНС необлагаемые коды доходов:
	// КД 10, 14, 15, 16, 17, 19, 20, 22, 25, 27, 30, 34 - 38, 40, 33.
	
	Результат = (ВидДохода = ДоходыТовары)                     // 33
		ИЛИ (ВидДохода = ДоходыГосЦБ)                          // 10
		ИЛИ (ВидДохода = ДоходыОтРеализацииАкцийРФНеБолее50)   // 14
		ИЛИ (ВидДохода = ДоходыРеализацияЦенныхБумаг)          // 15
		ИЛИ (ВидДохода = ДоходыСрочныеФинИнструменты)          // 16
		ИЛИ (ВидДохода = ДоходыВалютныеОпераций)               // 17
		ИЛИ (ВидДохода = ДоходыРеализацияНедвижимостиНеРФ)     // 19
		ИЛИ (ВидДохода = ДоходыРеализацияИмущества)            // 20
		ИЛИ (ВидДохода = ДоходыАрендаИмуществаНеРФ)            // 22
		ИЛИ (ВидДохода = ДоходыТЭО)                            // 25
		ИЛИ (ВидДохода = ПроцентыДепоПремий)                   // 27
		ИЛИ (ВидДохода = ДоходыПИФНеБолее50)                   // 30
		ИЛИ (ВидДохода = ДоходыИноеИмуществоНеОблагаемые)      // 34
		ИЛИ (ВидДохода = ДоходыИмущественныеПраваНеОблагаемые) // 35
		ИЛИ (ВидДохода = ДоходыУслугиНеОблагаемые)             // 36
		ИЛИ (ВидДохода = ДоходыОблигацииНеОблагаемые)          // 37
		ИЛИ (ВидДохода = ДоходыВПределахВкладаАкционера)       // 38
		ИЛИ (ВидДохода = ИныеДоходыНеОблагаемые);              // 40
	
	Возврат Результат;
	
КонецФункции

// Код вида дохода.
// 
// Параметры:
//  ВидДохода - ПеречислениеСсылка.ВидыДоходовИностранныхОрганизаций.
// 
// Возвращаемое значение:
//  Строка - Код вида дохода
Функция КодВидаДохода(ВидДохода) Экспорт

	КодВидаДохода = Лев(ВидДохода, 2);
	
	Возврат КодВидаДохода;
	
КонецФункции

#КонецОбласти

#КонецЕсли
